---
title: LocationCurve
classe: Autodesk.Revit.DB.LocationCurve
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Location
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# LocationCurve

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Curve Curve { get; set; }` | `locationCurve.Curve` | Curve |
| `ElementArray ElementsAtJoin { get; set; }` | `locationCurve.ElementsAtJoin` | ElementArray |
| `JoinType JoinType { get; set; }` | `locationCurve.JoinType` | JoinType |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```